Interhub spec FHIR spec, draft 2
